### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
!       arn               = "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-auth-lambda" -> (known after apply)
!       id                = "/aws/lambda/cataprato-auth-lambda" -> (known after apply)
!       name              = "/aws/lambda/cataprato-auth-lambda" -> "/aws/lambda/authentication"
+       name_prefix       = (known after apply)
        tags              = {
            "Deployment" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.additional_inline[0] must be replaced
-/+ resource "aws_iam_policy" "additional_inline" {
!       arn         = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-inline" -> (known after apply)
!       id          = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-inline" -> (known after apply)
!       name        = "cataprato-auth-lambda-inline" -> "authentication-inline"
+       name_prefix = (known after apply)
!       policy_id   = "ANPAVDBLQB3NGMEOVGLQM" -> (known after apply)
        tags        = {
            "Deployment" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
!       arn         = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-logs" -> (known after apply)
!       id          = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-logs" -> (known after apply)
!       name        = "cataprato-auth-lambda-logs" -> "authentication-logs"
+       name_prefix = (known after apply)
!       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-auth-lambda:*:*",
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-auth-lambda:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
!       policy_id   = "ANPAVDBLQB3NLK643GDXY" -> (known after apply)
        tags        = {
            "Deployment" = "terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
!       arn                   = "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda" -> (known after apply)
!       create_date           = "2023-08-09T13:35:07Z" -> (known after apply)
!       id                    = "cataprato-auth-lambda" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-inline",
-           "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-logs",
        ] -> (known after apply)
!       name                  = "cataprato-auth-lambda" -> "authentication"
+       name_prefix           = (known after apply)
        tags                  = {
            "Deployment" = "terraform"
        }
!       unique_id             = "AROAVDBLQB3NMT4BHTGYA" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "additional_inline" {
!       id         = "cataprato-auth-lambda-20230815031428116300000001" -> (known after apply)
!       policy_arn = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-inline" -> (known after apply)
!       role       = "cataprato-auth-lambda" -> "authentication"
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
!       id         = "cataprato-auth-lambda-20230809133508079600000002" -> (known after apply)
!       policy_arn = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-logs" -> (known after apply)
!       role       = "cataprato-auth-lambda" -> "authentication"
    }

  # module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
!       arn                            = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda" -> (known after apply)
!       description                    = "Cataprato auth" -> "Cataprato authentication"
!       function_name                  = "cataprato-auth-lambda" -> "authentication"
!       id                             = "cataprato-auth-lambda" -> (known after apply)
!       invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda/invocations" -> (known after apply)
!       last_modified                  = "2023-08-19T01:18:01.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:48",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:38" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:38/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda" -> (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
!       source_code_hash               = "iL3ARvgG64toWYO91e7wsr5z2aPklajl6woMJ2Ptj4M=" -> (known after apply)
!       source_code_size               = 5266 -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "38" -> (known after apply)
        # (13 unchanged attributes hidden)

-       tracing_config {
-           mode = "PassThrough" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
!       function_arn       = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda" -> (known after apply)
!       function_name      = "cataprato-auth-lambda" -> "authentication"
!       function_url       = "https://qicsbeezgagmt2gnnaelk53zn40egzux.lambda-url.us-east-1.on.aws/" -> (known after apply)
!       id                 = "cataprato-auth-lambda" -> (known after apply)
!       url_id             = "qicsbeezgagmt2gnnaelk53zn40egzux" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       function_name       = "cataprato-auth-lambda" -> "authentication"
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "38" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       function_name       = "cataprato-auth-lambda" -> "authentication"
!       id                  = "APIGatewayAny" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6612468566031334978" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692407805688576000" -> "1692416161696468200"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:48" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-19T01:17:46.243+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:48" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
!       s3_object_version           = "X1dwB6gJ530rNl9HTo6wABy0x7F0YDYe" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "maDTpdxJ07uM1lTVntIy1YdXGz4oLCphYj6MM8WPb24=" -> (known after apply)
!       source_code_size            = 29769428 -> (known after apply)
!       version                     = "48" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "6ef287ae35d8ec2f6cc3bc856a6416a2-6" -> (known after apply)
!       id                     = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> (known after apply)
!       key                    = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "X1dwB6gJ530rNl9HTo6wABy0x7F0YDYe" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7152946744829549563" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
!           "timestamp" = "1692407807242903000" -> "1692416163224896000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "3467295522622332332" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/5b5d6b5b2dea79b029bd000be162d28eb4df30f108e7e3deb4cbcb6027f331ad.zip" -> "builds/78c69c6071124b0037dd5fe82016961e83475337058302f9700a18f60a93c5ae.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 16 to add, 0 to change, 15 to destroy.
```
</details>